d = list(map(int, input()))
s1 = d[0] ^ d[2] ^ d[4] ^ d[6]
s2 = d[1] ^ d[2] ^ d[5] ^ d[6]
s3 = d[3] ^ d[4] ^ d[5] ^ d[6]
res = str(s1) + str(s2) + str(s3)
mp = {
    "000": ["отсутствует", -1],
    "100": ["в бите r1", 0],
    "010": ["в бите r2", 1],
    "110": ["в бите i1", 2],
    "001": ["в бите r3", 3],
    "101": ["в бите i2", 4],
    "011": ["в бите i3", 5],
    "111": ["в бите i4", 6]
}
print("Ошибка " + mp[res][0])
if mp[res][1] != -1: 
    if d[mp[res][1]] == 0:
        d[mp[res][1]] = 1
    else:
        d[mp[res][1]] = 0
print(str(d[2]) + str(d[4]) + str(d[5]) + str(d[6]))
