import re

#main task
#  =-\

p = r'=-\\'
tests = [
    r"sdns=-\dkjskdj=\sd-\sd", #1
    r"=-\sd=-\\", #2
    r"=-\ =-\=\ sdl=-s\kdlsdk", #2
    r"=\=\=\=-\s=-\s=-\s=-\s", #4
    r"=-\=-\=-\=-\=-\\", #5
]
for i in tests: print(len(re.findall(p, i)))

#additional task 1 (var 4)

p = r'([0-1][0-9]|[2][0-3])(:[0-5][0-9]){1,2}'
tests = [
    '''Уважаемые студенты! В эту субботу в 
15:00 планируется доп. занятие на 2 
часа. То есть в 17:00:01 оно уже точно 
кончится.''', 
    # Уважаемые студенты! В эту субботу в 
    # (TBD) планируется доп. занятие на 2 
    # часа. То есть в (TBD) оно уже точно 
    # кончится.
    'skjsdh 17:00:0s 24:00:00', #skjsdh (TBD):0s 24:(TBD)
    '10:00:00, 123:23:L2, 00:00:09', #(TBD), 1(TBD):L2, (TBD)
    'a:b:c 0:0:0', #a:b:c 0:0:0
    '00:0000, 9810:0523, 98989:98989', #(TBD)00, 98(TBD)23, 98989:98989
    '09:09:0, 00: 00: 00' #(TBD):0, 00: 00: 00
]

for i in tests: print(re.sub(p, "(TBD)", i))

#additional task 2 (var 4)
#for minutes

s1 = r'((((\*)|((([1-5]\d)|(\d))((-(([1-5]\d)|(\d))){0,1})))((/(([1-5]\d)|(\d))){0,1}))((,((\*)|((([1-5]\d)|(\d))((-(([1-5]\d)|(\d))){0,1})))(/(([1-5]\d)|(\d))){0,1}){0,}))'
#for hours
s2 = r'((((\*)|(([2][0-3]|[1]\d|\d)((-([2][0-3]|[1]\d|\d)){0,1})))((/([2][0-3]|[1]\d|\d)){0,1}))((,(((\*)|(([2][0-3]|[1]\d|\d)((-([2][0-3]|[1]\d|\d)){0,1})))((/([2][0-3]|[1]\d|\d)){0,1}))){0,}))'
#for day of month
s3 = r'((([3][01]|[12]\d|[1-9])W)|(L)|(\?)|((((\*)|(([3][01]|[12]\d|[1-9])((-([3][01]|[12]\d|[1-9])){0,1})))((/([3][01]|[12]\d|[1-9])){0,1}))((,(((\*)|(([3][01]|[12]\d|[1-9])((-([3][01]|[12]\d|[1-9])){0,1})))((/([3][01]|[12]\d|[1-9])){0,1}))){0,})))'
#for month
s4 = r'((((\*)|(([1][0-2]|[1-9]|jan|feb|mar|apr|may|jun|jul|aug|sep|oct|nov|dec)((-([1][0-2]|[1-9]|jan|feb|mar|apr|may|jun|jul|aug|sep|oct|nov|dec)){0,1})))((/([1][0-2]|[1-9])){0,1}))((,(((\*)|(([1][0-2]|[1-9]|jan|feb|mar|apr|may|jun|jul|aug|sep|oct|nov|dec)((-([1][0-2]|[1-9]|jan|feb|mar|apr|may|jun|jul|aug|sep|oct|nov|dec)){0,1})))((/([1][0-2]|[1-9])){0,1}))){0,}))'
#for day of week
s5 = r'((([0-6]|sun|mon|tue|wed|thu|fri|sat)#[1-5])|(\?)|((((\*)|(([0-6]L)|(([0-6]|sun|mon|tue|wed|thu|fri|sat)((-([0-6]|sun|mon|tue|wed|thu|fri|sat)){0,1}))))((/[0-7]){0,1}))((,(((\*)|(([0-6]L)|(([0-6]|sun|mon|tue|wed|thu|fri|sat)((-([0-6]|sun|mon|tue|wed|thu|fri|sat)){0,1}))))((/[0-7]){0,1}))){0,})))'

s = '(@weekly)|(@daily)|' + (s1 + ' ' + s2 + ' ' + s3 + ' ' + s4 + ' ' + s5)

tests = [
    '30 14 * * *', #yes
    '*/5 * * * *', #yes
    '0 0 1 1 *', #yes
    '0-t * * * *', #no
    '*/* * x i 5#p', #no
    '@daily',
    'weekly'
]

for i in tests: print('yes' if re.fullmatch(s, i) != None else 'no')
